app/views/users/info.html.erb

									<dt>Products submitted</dt>
									<dd><%= @user.products.count %></dd>
---
SELECT "products".* FROM "products" WHERE "products"."user_id" = ?  [["user_id", 6]]
SELECT COUNT(*) FROM "products" WHERE "products"."user_id" = ?  [["user_id", 6]]

													<div class="likes"><i class="ico i-likes"></i><a href="#">10</a></div>
													<div class="comments"><i class="ico i-comments"></i><a href="recipe.html#comments"><%= product.comments.count%></a></div>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 16]]