app/views/welcome/index.html.erb

												<div class="likes"><i class="ico i-likes"></i><a href="#">10</a></div>
												<div class="comments"><i class="ico i-comments"></i><a href="recipe.html#comments"><%= product_lasted.comments.count %></a></div>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 20]]