app/controllers/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 13]]
---
	def detail
		if Product.exists?(id: params[:product_id])
			@product = Product.find(params[:product_id])

SELECT "products".* FROM "products"  ORDER BY "products"."id" DESC
---
	def receipts
		@products = Product.order(id: :desc)

SELECT "categories".* FROM "categories"
---
	def newproduct
		@categorys = Category.all

INSERT INTO "products" ("title", "description", "photo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["description", ""], ["photo", nil], ["created_at", "2015-05-22 11:17:57.762332"], ["updated_at", "2015-05-22 11:17:57.762332"]]
---
	def create
		@product = Product.new(product_params)
		@product.photo = params[:product][:photo]
		@product.user_id = session[:user]["id"]
		if @product.save