app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
---
	def info
		@user = User.find(session[:user]["id"])

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "nopunguyen123@gmail.com"]]
SELECT  1 AS one FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "nopunguyen123@gmail.com"]]
---
	def login
		if User.exists?(email: params[:user][:email])

SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 1
SELECT  1 AS one FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "ngocphu.uit@gmail.com"]]
INSERT INTO "users" ("name", "email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "NoPu Nguyễn"], ["email", "ngocphu.uit@gmail.com"], ["encrypted_password", "123123123"], ["created_at", "2015-04-25 07:34:52.514459"], ["updated_at", "2015-04-25 07:34:52.514459"]]
---
	def register
		if params[:user][:password] == params[:user][:confirm_password]
			if User.exists?(email: params[:user][:email]) || validate_email(params[:user][:email])
				redirect_to users_register_path
			else
				@user = User.new(user_params)
				@user.password = params[:user][:password]
				if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "users" SET "address" = $1, "phone" = $2, "avatar" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["address", "Bình Thạnh Thành Phố Hồ Chí Minh "], ["phone", 975667043], ["avatar", "chipu.jpg"], ["updated_at", "2015-05-27 08:32:37.902867"], ["id", 2]]
---
	def edit
		@user = User.find(session[:user]["id"])
		@user.name = params[:user][:name]
		@user.address = params[:user][:address]
		@user.phone = params[:user][:phone]
		@user.avatar = params[:user][:avatar]
		if @user.save