app/controllers/welcome_controller.rb

	def index
		@product_lasteds = Product.order(id: :desc).limit(6)
---
SELECT  "products".* FROM "products"  ORDER BY "products"."id" DESC LIMIT 6